tutorials/internal/Poiseullie/periodic/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       63;
    }
    left
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       64;
        matchTolerance  0.0001;
        neighbourPatch  right;
        transformType   translational;
        separation      (-0.2 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          64;
        startFace       128;
        matchTolerance  0.0001;
        neighbourPatch  left;
        transformType   translational;
        separation      (0.2 0 0);
    }
    centerline
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       192;
    }
    wedgem
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          64;
        startFace       192;
    }
    wedgep
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          64;
        startFace       256;
    }
)

// ************************************************************************* //
