tutorials/internal/Poiseullie/periodic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


//- radius [m]
radius  0.5;

// Half angle of wedge [deg]
halfAngle 1;

//- Derived quantities
radHalfAngle #calc "degToRad($halfAngle)";
zmax #calc "$radius*sin($radHalfAngle)";
zmin #calc "-($zmax)";
y    #calc "$radius*cos($radHalfAngle)";

vertices
(   
    // wedge minus
    (-0.1 0  0)
    ( 0.1 0  0)
    ( 0.1 $y $zmin)
    (-0.1 $y $zmin)

    // wedge plus
    ( 0.1 $y $zmax)
    (-0.1 $y $zmax)
);

blocks
(
    hex (0 1 2 3 0 1 4 5) (1 64 1) simpleGrading (1 0.2 1)
);

edges
(
    arc 2 4 (0.1  $radius 0)
    arc 3 5 (-0.1 $radius 0)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (2 3 5 4)
        );
    }
    
    left
    {
        type cyclic;
        neighbourPatch right;
        faces
        (
            (0 3 5 0)
        );
    }

    right
    {
        type cyclic;
        neighbourPatch left;
        faces
        (
            (1 2 4 1)
        );
    }

    centerline
    {
        type empty;
        faces
        (
            (0 1 1 0)
        );
    }

    wedgem
    {
        type wedge;
        faces
        (
            (0 1 2 3)
        );
    }

    wedgep
    {
        type wedge;
        faces
        (
            (0 1 4 5)
        );
    }
);


// ************************************************************************* //
